# Estadistica Aplicada
Sesión 4, 14 agosto

Jorge Sebastian Aguirre Jimenez 1947870

In [1]:
lista=['Jaime','Pedro','Maria']

In [2]:
lista.append('Jimena')

In [3]:
lista

['Jaime', 'Pedro', 'Maria', 'Jimena']

In [4]:
# Tuplas
tupla=(23,45,'libro')

In [5]:
type(tupla)

tuple

La principal característica de una tupla es que es inmutable, no se puede modificar

Diccionarios (mapeo de valores)

Un diccionario es un par de clave-valor

In [6]:
alumno_dic={'Nombre':'Juan','Apellido':'Perez','Edad':21}

In [7]:
alumno_dic['Nombre']

'Juan'

In [8]:
alumno_dic['Edad']

21

In [9]:
##Accedemos a las variables keys
alumno_dic.keys()

dict_keys(['Nombre', 'Apellido', 'Edad'])

In [10]:
alumno_dic.values()

dict_values(['Juan', 'Perez', 21])

In [11]:
#Crear un diccionario de los alumnos del grupo
estadistica_g41={'Nombre':['Juan','Sebas','Sorely'],'Edad':[19,19,18.5]}

In [13]:
estadistica_g41.keys()

dict_keys(['Nombre', 'Edad'])

In [14]:
estadistica_g41.values()

dict_values([['Juan', 'Sebas', 'Sorely'], [19, 19, 18.5]])

## Pandas
Se utiliza para manipular datos estructurados. Esta construida sobre numpy, por lo tanto, cualquier funcion de numpy funciona en pandas. En pandas hay tres estructuras de datos:

1. Series (unidimensionales)
2. Dataframes (datos en filas y columnas)
3. Panel (tiempo)

Series:

Supongamos que conocemos las edades de las siguientes persona: Juan 10, Pedro 20, Jorge 30, Ale 40, Alba 50

In [15]:
edades=[10,20,30,40,50]

In [16]:
edades

[10, 20, 30, 40, 50]

In [17]:
import pandas as pd

In [18]:
serie=pd.Series(edades,index=['Juan','Pedro','Jorge', 'Ale','Alban'])

In [19]:
serie

Juan     10
Pedro    20
Jorge    30
Ale      40
Alban    50
dtype: int64

In [20]:
serie.mean()

30.0

In [21]:
serie.std()

15.811388300841896

## DataFrames

Datos en filas y columnas

In [23]:
alumno1=['Juan','Perez',23]
alumno2=['Raul','Gonzalez',17]
alumno3=['Jimena','Rosas',20]
alumno4=['Alejandra','Saldaña',21]

In [24]:
clase_estadistica=[alumno1,alumno2,alumno3,alumno4]

In [25]:
clase_estadistica

[['Juan', 'Perez', 23],
 ['Raul', 'Gonzalez', 17],
 ['Jimena', 'Rosas', 20],
 ['Alejandra', 'Saldaña', 21]]

In [26]:
df_clase=pd.DataFrame(clase_estadistica,columns=['Nombre','Apellido', 'Edad'])

In [27]:
type(df_clase)

pandas.core.frame.DataFrame

In [28]:
df_clase

      Nombre  Apellido  Edad
0       Juan     Perez    23
1       Raul  Gonzalez    17
2     Jimena     Rosas    20
3  Alejandra   Saldaña    21

In [29]:
df_clase.index

RangeIndex(start=0, stop=4, step=1)

In [30]:
df_clase.columns

Index(['Nombre', 'Apellido', 'Edad'], dtype='object')

In [31]:
df_clase['Estado']=['Nuevo Leon','Coahuila','Nuevo Leon','Veracruz']

In [32]:
df_clase

      Nombre  Apellido  Edad      Estado
0       Juan     Perez    23  Nuevo Leon
1       Raul  Gonzalez    17    Coahuila
2     Jimena     Rosas    20  Nuevo Leon
3  Alejandra   Saldaña    21    Veracruz

In [33]:
df_clase=df_clase.set_index('Nombre')

In [34]:
df_clase

           Apellido  Edad      Estado
Nombre
Juan          Perez    23  Nuevo Leon
Raul       Gonzalez    17    Coahuila
Jimena        Rosas    20  Nuevo Leon
Alejandra   Saldaña    21    Veracruz

In [35]:
df_clase['Edad en dias']=df_clase['Edad']*365

In [36]:
df_clase

           Apellido  Edad      Estado  Edad en dias
Nombre
Juan          Perez    23  Nuevo Leon          8395
Raul       Gonzalez    17    Coahuila          6205
Jimena        Rosas    20  Nuevo Leon          7300
Alejandra   Saldaña    21    Veracruz          7665

In [44]:
df_clase['Edad en meses']=df_clase['Edad en dias']/30.4

In [45]:
df_clase

           Apellido  Edad      Estado  Edad en dias  Edad en meses
Nombre
Juan          Perez    23  Nuevo Leon          8395     276.151316
Raul       Gonzalez    17    Coahuila          6205     204.111842
Jimena        Rosas    20  Nuevo Leon          7300     240.131579
Alejandra   Saldaña    21    Veracruz          7665     252.138158

## Seleccion en dataframes
1. Seleccion estandar 
2. iloc
3. loc
4. Boleanos (filtros)

In [46]:
#Seleccion estandar
df_clase['Apellido']

Nombre
Juan            Perez
Raul         Gonzalez
Jimena          Rosas
Alejandra     Saldaña
Name: Apellido, dtype: object

In [48]:
df_clase[['Edad','Apellido']]
#es doble corchete ya que al ser 2 objetos o mas es una lista y por lo tanto se indica como tal

           Edad  Apellido
Nombre
Juan         23     Perez
Raul         17  Gonzalez
Jimena       20     Rosas
Alejandra    21   Saldaña

In [49]:
df_clase[0:2]

        Apellido  Edad      Estado  Edad en dias  Edad en meses
Nombre
Juan       Perez    23  Nuevo Leon          8395     276.151316
Raul    Gonzalez    17    Coahuila          6205     204.111842

In [52]:
#elegir columna edad, filas 0,1
#siempre indicamos filas y luego columnas

df_clase[0:2][['Edad','Apellido']]

        Edad  Apellido
Nombre
Juan      23     Perez
Raul      17  Gonzalez

# Seleccion por i.loc

In [53]:

#dataframe.iloc[filas, columnas]

df_clase.iloc[0:2,1]

Nombre
Juan    23
Raul    17
Name: Edad, dtype: int64

In [54]:
df_clase.iloc[:,1]

Nombre
Juan         23
Raul         17
Jimena       20
Alejandra    21
Name: Edad, dtype: int64

# Seleccion por etiquetas .loc
dataframe.loc[filas, columnas]

In [56]:
df_clase.loc[:,'Edad']

Nombre
Juan         23
Raul         17
Jimena       20
Alejandra    21
Name: Edad, dtype: int64

In [57]:
df_clase.loc['Juan','Edad']

23

In [58]:
edad_juan= df_clase.loc['Juan','Edad']

# Seleccion con condicionales (boleanos)

In [59]:
df_clase[df_clase['Edad']>20]

          Apellido  Edad      Estado  Edad en dias  Edad en meses
Nombre
Juan         Perez    23  Nuevo Leon          8395     276.151316
Alejandra  Saldaña    21    Veracruz          7665     252.138158

In [60]:
df_clase['Edad']

Nombre
Juan         23
Raul         17
Jimena       20
Alejandra    21
Name: Edad, dtype: int64

In [62]:
df_clase['Edad'].mean()

20.25

In [63]:
df_clase['Edad'].std()

2.5

In [64]:
df_clase['Edad'].sum()

81

In [66]:
import numpy as np

In [ ]:
#np.where(condicion,true,false)

In [68]:
df_clase['Mayor de edad']=np.where(df_clase['Edad']>=18,'Mayor de edad','Menor de edad')

In [85]:
df_clase

,Apellido,Edad,Estado,Edad en dias,Edad en meses,Mayor de edad,Condicón de estudio,Condición de estudio
Nombre,,,,,,,,
Juan,Perez,23,Nuevo Leon,8395,276.151316,Mayor de edad,Egresados,Egresados
Raul,Gonzalez,17,Coahuila,6205,204.111842,Menor de edad,Preparatoria,Preparatoria
Jimena,Rosas,20,Nuevo Leon,7300,240.131579,Mayor de edad,Licenciatura,Licenciatura
Alejandra,Saldaña,21,Veracruz,7665,252.138158,Mayor de edad,Licenciatura,Licenciatura

In [ ]:
#np.select
#como un si.conjunto de excel
#np.select(condiciones,mult true,false)

In [72]:
condiciones=[df_clase['Edad']<=17,
             df_clase['Edad']<23,
             df_clase['Edad']>=23]
valor_condicion=['Preparatoria','Licenciatura','Egresados']
df_clase['Condición de estudio']=np.select(condiciones,valor_condicion,default='Invalido')

In [81]:
df_clase

,Apellido,Edad,Estado,Edad en dias,Edad en meses,Mayor de edad,Condicón de estudio,Condición de estudio
Nombre,,,,,,,,
Juan,Perez,23,Nuevo Leon,8395,276.151316,Mayor de edad,Egresados,Egresados
Raul,Gonzalez,17,Coahuila,6205,204.111842,Menor de edad,Preparatoria,Preparatoria
Jimena,Rosas,20,Nuevo Leon,7300,240.131579,Mayor de edad,Licenciatura,Licenciatura
Alejandra,Saldaña,21,Veracruz,7665,252.138158,Mayor de edad,Licenciatura,Licenciatura

In [74]:
df_clase['Edad'].count()

4

In [75]:
df_clase.value_counts('Mayor de edad')

Mayor de edad
Mayor de edad    3
Menor de edad    1
Name: count, dtype: int64

In [79]:
df_clase.value_counts('Condición de estudio')

Condición de estudio
Licenciatura    2
Egresados       1
Preparatoria    1
Name: count, dtype: int64

In [106]:
##Query
df_clase.query('Edad>20')

,Apellido,Edad,Estado,Edad en dias,Edad en meses,Mayor de edad,Condicón de estudio,Condición de estudio
Nombre,,,,,,,,
Juan,Perez,23,Nuevo Leon,8395,276.151316,Mayor de edad,Egresados,Egresados
Alejandra,Saldaña,21,Veracruz,7665,252.138158,Mayor de edad,Licenciatura,Licenciatura

In [108]:
df_clase.query('Nombre=="Alejandra"')

,Apellido,Edad,Estado,Edad en dias,Edad en meses,Mayor de edad,Condicón de estudio,Condición de estudio
Nombre,,,,,,,,
Alejandra,Saldaña,21,Veracruz,7665,252.138158,Mayor de edad,Licenciatura,Licenciatura

In [109]:
##Seleccionar a Alejandra y los que sean mayores de edad
df_clase.query('Nombre=="Alejandra" & Edad>20')

,Apellido,Edad,Estado,Edad en dias,Edad en meses,Mayor de edad,Condicón de estudio,Condición de estudio
Nombre,,,,,,,,
Alejandra,Saldaña,21,Veracruz,7665,252.138158,Mayor de edad,Licenciatura,Licenciatura

In [121]:
df_clase=df_clase.loc[:,df_clase.columns!='Condicón de estudio']

In [122]:
df_clase

,Apellido,Edad,Estado,Edad en dias,Edad en meses,Mayor de edad,Condición de estudio
Nombre,,,,,,,
Juan,Perez,23,Nuevo Leon,8395,276.151316,Mayor de edad,Egresados
Raul,Gonzalez,17,Coahuila,6205,204.111842,Menor de edad,Preparatoria
Jimena,Rosas,20,Nuevo Leon,7300,240.131579,Mayor de edad,Licenciatura
Alejandra,Saldaña,21,Veracruz,7665,252.138158,Mayor de edad,Licenciatura

In [153]:
calificaciones=pd.read_csv('https://raw.githubusercontent.com/jimmyzac/Estadistica-Aplicada-FCFM-UANL/main/bases_datos/Calificaciones.csv')

In [154]:
calificaciones.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28 entries, 0 to 27
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Id                 28 non-null     int64
 1   Nombre             28 non-null     object
 2   Apellido           28 non-null     object
 3   Calficación Final  28 non-null     int64
dtypes: int64(2), object(2)
memory usage: 1.0+ KB

In [155]:
calificaciones.describe()

              Id  Calficación Final
count  28.000000          28.000000
mean   14.500000          52.000000
std     8.225975          34.113102
min     1.000000           1.000000
25%     7.750000          18.500000
50%    14.500000          48.500000
75%    21.250000          85.250000
max    28.000000         100.000000

In [156]:
calificaciones.shape

(28, 4)

In [157]:
calificaciones.head(10)

   Id            Nombre   Apellido  Calficación Final
0   1           ANTONIO     GARCIA                 73
1   2            MANUEL  FERNANDEZ                 19
2   3              JOSE   GONZALEZ                 38
3   4             DAVID      PEREZ                 14
4   5              JUAN      LOPEZ                 99
5   6      JOSE ANTONIO  RODRIGUEZ                 66
6   7            JAVIER    SANCHEZ                 46
7   8         JOSE LUIS      GOMEZ                 89
8   9  FRANCISCO JAVIER    JIMENEZ                 10
9  10            CARLOS       RUIZ                 62

In [158]:
calificaciones.tail(7)

    Id       Nombre   Apellido  Calficación Final
21  22     FERNANDO    SALAZAR                 51
22  23        JORGE      RAMOS                 76
23  24         LUIS  DOMINGUEZ                 12
24  25      ALBERTO      ORTIZ                 99
25  26  JUAN CARLOS     IBAÑEZ                 43
26  27       ALVARO    RAMIREZ                 40
27  28       ADRIAN       SAEZ                  7

In [159]:
##vamos a elegir todas las columnas menos id
calificaciones=calificaciones.loc[:,calificaciones.columns!='Id']

In [160]:
calificaciones.head()

    Nombre   Apellido  Calficación Final
0  ANTONIO     GARCIA                 73
1   MANUEL  FERNANDEZ                 19
2     JOSE   GONZALEZ                 38
3    DAVID      PEREZ                 14
4     JUAN      LOPEZ                 99

In [161]:
#renombrar la columna de calif
#nombre viejo: nombre nuevo
calificaciones=calificaciones.rename(columns={'Calficación Final':'Calificación Final'})

In [162]:
calificaciones.head()

    Nombre   Apellido  Calificación Final
0  ANTONIO     GARCIA                  73
1   MANUEL  FERNANDEZ                  19
2     JOSE   GONZALEZ                  38
3    DAVID      PEREZ                  14
4     JUAN      LOPEZ                  99

In [166]:
calificaciones['Estatus']=np.where(calificaciones['Calificación Final']>=70,'Aprobado','Reprobado')

In [167]:
calificaciones.head()

    Nombre   Apellido  Calificación Final    Estatus
0  ANTONIO     GARCIA                  73   Aprobado
1   MANUEL  FERNANDEZ                  19  Reprobado
2     JOSE   GONZALEZ                  38  Reprobado
3    DAVID      PEREZ                  14  Reprobado
4     JUAN      LOPEZ                  99   Aprobado